ltowarek/esp-opentelemetry-cpp/examples/traces/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# The exporter this example constructs must be compiled in; the OTLP/HTTP and
# Ostream ones are not needed here.
CONFIG_ESP_OPENTELEMETRY_EXPORTER_ESP_LOG=y
CONFIG_ESP_OPENTELEMETRY_EXPORTER_OSTREAM=n
CONFIG_ESP_OPENTELEMETRY_EXPORTER_OTLP_HTTP=n

# The Batch processors and the metric reader run export threads that serialise
# before printing; 3 KB (the IDF default) is too small.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=32768

CONFIG_ESP_OPENTELEMETRY_TRACING_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_SERVICE_NAME="traces-example"
